EtchedPixels/FUZIX/Kernel/platform-dk-tm4c129x/eth.c
#include <kernel.h>
#include <kdata.h>
#include "cpu.h"
#include "inline-irq.h"
#include "interrupt.h"
#include "tm4c129x.h"
#include "gpio.h"

#include "eth.h"

#define ETH_PKTSIZE 590U
#define OPTIMAL_EMAC_BUFSIZE ((ETH_PKTSIZE + 4U + 15U) & (~15U))

#define FLASH_USERREG0 0x400fe1e0
#define FLASH_USERREG1 0x400fe1e4

#define SYSCON_SREPHY     0x400fe530
#define SYSCON_SREMAC     0x400fe59c
#define SYSCON_RCGCEPHY   0x400fe630
#define SYSCON_RCGCEMAC   0x400fe69c
#define SYSCON_PCEPHY     0x400fe930
#define SYSCON_PCEMAC     0x400fe99c
#define SYSCON_PREPHY     0x400fea30
#define SYSCON_PREMAC     0x400fea9c

#define SREPHY_R0   1U
#define SREMAC_R0   1U
#define RCGCEPHY_R0 1U
#define RCGCEMAC_R0 1U
#define PCEPHY_P0   1U
#define PCEMAC_P0   1U
#define PREPHY_R0   1U
#define PREMAC_R0   1U

#define ephy_periphrdy() ((bool)(((inl(SYSCON_PREPHY)) & (PREPHY_R0))))
#define emac_periphrdy() ((bool)(((inl(SYSCON_PREMAC)) & (PREMAC_R0))))

#define PHY_RESET_DELAY   65U
#define PHY_CONFIG_DELAY  1000U
#define PHY_READ_TIMEOUT  0x4ffffU
#define PHY_WRITE_TIMEOUT 0x4ffffU
#define PHY_RETRY_TIMEOUT 0x4ffffU

#define INTERNAL_PHY_PHYADDR 0U

#define EPHY_BMCR         0x00U
#define EPHY_BMSR         0x01U
#define EPHY_ID1          0x02U
#define EPHY_ID2          0x03U
#define EPHY_ANA          0x04U
#define EPHY_ANLPA        0x05U
#define EPHY_ANER         0x06U
#define EPHY_ANNPTR       0x07U
#define EPHY_ANLNPTR      0x08U
#define EPHY_CFG1         0x09U
#define EPHY_CFG2         0x0aU
#define EPHY_CFG3         0x0bU
#define EPHY_REGCTL       0x0dU
#define EPHY_ADDAR        0x0eU
#define EPHY_STS          0x10U
#define EPHY_SCR          0x11U
#define EPHY_MISR1        0x12U
#define EPHY_MISR2        0x13U
#define EPHY_FCSCR        0x14U
#define EPHY_RXERCNT      0x15U
#define EPHY_BISTCR       0x16U
#define EPHY_LEDCR        0x18U
#define EPHY_CTL          0x19U
#define EPHY_10BTSC       0x1aU
#define EPHY_BICSR1       0x1bU
#define EPHY_BICSR2       0x1cU
#define EPHY_CDCR         0x1eU
#define EPHY_RCR          0x1fU
#define EPHY_LEDCFG       0x25U

#define EMAC_NRXDESC      8U
#define EMAC_NTXDESC      4U
#define EMAC_NFREEBUFFERS (EMAC_NTXDESC + 1U)

#define EMAC_CFG          0x400ec000
#define EMAC_FRAMEFLTR    0x400ec004
#define EMAC_HASHTBLH     0x400ec008
#define EMAC_HASHTBLL     0x400ec00c
#define EMAC_MIIADDR      0x400ec010
#define EMAC_MIIDATA      0x400ec014
#define EMAC_FLOWCTL      0x400ec018
#define EMAC_VLANTG       0x400ec01c
#define EMAC_IM           0x400ec03c
#define EMAC_ADDR0H       0x400ec040
#define EMAC_ADDR0L       0x400ec044
#define EMAC_MMCRXIM      0x400ec10c
#define EMAC_MMCTXIM      0x400ec110
#define EMAC_DMABUSMOD    0x400ecc00
#define EMAC_TXPOLLD      0x400ecc04
#define EMAC_RXPOLLD      0x400ecc08
#define EMAC_RXDLADDR     0x400ecc0c
#define EMAC_TXDLADDR     0x400ecc10
#define EMAC_DMARIS       0x400ecc14
#define EMAC_DMAOPMODE    0x400ecc18
#define EMAC_DMAIM        0x400ecc1c
#define EMAC_PC           0x400ecfc4
#define EMAC_CC           0x400ecfc8

#define EMAC_IM_PMT       (1U <<  3U)
#define EMAC_IM_TSI       (1U <<  9U)
#define EMAC_IM_ALLINTS   (EMAC_IM_PMT | EMAC_IM_TSI)

#define EMAC_DMAINT_TI    (1U <<  0U)
#define EMAC_DMAINT_TPSI  (1U <<  1U)
#define EMAC_DMAINT_TBUI  (1U <<  2U)
#define EMAC_DMAINT_TJTI  (1U <<  3U)
#define EMAC_DMAINT_OVFI  (1U <<  4U)
#define EMAC_DMAINT_UNFI  (1U <<  5U)
#define EMAC_DMAINT_RI    (1U <<  6U)
#define EMAC_DMAINT_RBUI  (1U <<  7U)
#define EMAC_DMAINT_RPSI  (1U <<  8U)
#define EMAC_DMAINT_RWTI  (1U <<  9U)
#define EMAC_DMAINT_ETI   (1U << 10U)
#define EMAC_DMAINT_FBEI  (1U << 13U)
#define EMAC_DMAINT_ERI   (1U << 14U)
#define EMAC_DMAINT_AIS   (1U << 15U)
#define EMAC_DMAINT_NIS   (1U << 16U)

#define EMAC_DMAINT_RECV_ENABLE  (EMAC_DMAINT_NIS | EMAC_DMAINT_RI)
#define EMAC_DMAINT_XMIT_ENABLE  (EMAC_DMAINT_NIS | EMAC_DMAINT_TI)
#define EMAC_DMAINT_XMIT_DISABLE EMAC_DMAINT_TI
#define EMAC_DMAINT_ERROR_ENABLE 0U
#define EMAC_DMAINT_NORMAL \
  (EMAC_DMAINT_TI | EMAC_DMAINT_TBUI | EMAC_DMAINT_RI | EMAC_DMAINT_ERI)

#define EMAC_DMABUSMOD_SWR      (1U <<  0U)
#define EMAC_DMABUSMOD_DA       (1U <<  1U)
#define EMAC_DMABUSMOD_ATDS     (1U <<  7U)
#define EMAC_DMABUSMOD_FB       (1U << 16U)
#define EMAC_DMABUSMOD_USP      (1U << 23U)
#define EMAC_DMABUSMOD_8XPBL    (1U << 24U)
#define EMAC_DMABUSMOD_AAL      (1U << 25U)
#define EMAC_DMABUSMOD_MB       (1U << 26U)
#define EMAC_DMABUSMOD_TXPR     (1U << 27U)
#define EMAC_DMABUSMOD_RIB      (1U << 31U)

#define EMAC_DMABUSMOD_DSL_MASK (31U << 2U)
#define EMAC_DMABUSMOD_PBL_MASK (0x3fU << 8U)
#define EMAC_DMABUSMOD_PR_MASK  (3U << 14U)
#define EMAC_DMABUSMOD_RPBL_MASK (0x3fU << 17U)

#define EMAC_DMABUSMOD_DSL(n)   (((uint32_t)(n)) << 2U)
#define EMAC_DMABUSMOD_PBL(n)   (((uint32_t)(n)) << 8U)
#define EMAC_DMABUSMOD_RPBL(n)  (((uint32_t)(n)) << 17U)

#define EMAC_DMA_RXBURST 4
#define EMAC_DMA_TXBURST 4

#if (EMAC_DMA_RXBURST > 32) || (EMAC_DMA_TXBURST > 32)
#define __EMAC_DMABUSMOD_8XPBL 0U
#define __EMAC_DMA_RXBURST     EMAC_DMA_RXBURST
#define __EMAC_DMA_TXBURST     EMAC_DMA_TXBURST
#else
#define __EMAC_DMABUSMOD_8XPBL EMAC_DMABUSMOD_8XPBL
#define __EMAC_DMA_RXBURST     (EMAC_DMA_RXBURST >> 3U)
#define __EMAC_DMA_TXBURST     (EMAC_DMA_TXBURST >> 3U)
#endif

#define __EMAC_DMABUSMOD_PBL   (EMAC_DMABUSMOD_PBL(__EMAC_DMA_RXBURST))

#if __EMAC_DMA_RXBURST == __EMAC_DMA_TXBURST
#define __EMAC_DMABUSMOD_USP   0U
#define __EMAC_DMABUSMOD_RPBL  0U
#else
#define __EMAC_DMABUSMOD_USP   EMAC_DMABUSMOD_USP
#define __EMAC_DMABUSMOD_RPBL  EMAC_DMABUSMOD_RPBL(__EMAC_DMA_TXBURST)
#endif

#ifdef EMAC_ENHANCEDDESC
#define __EMAC_DMABUSMOD_ATDS  EMAC_DMABUSMOD_ATDS
#else
#define __EMAC_DMABUSMOD_ATDS  0U
#endif

#define EMAC_PC_PHYHOLD         (1U <<  0U)
#define EMAC_PC_ANEN            (1U <<  3U)
#define EMAC_PC_FASTANEN        (1U <<  6U)
#define EMAC_PC_EXTFD           (1U <<  7U)
#define EMAC_PC_FASTLUPD        (1U <<  8U)
#define EMAC_PC_FASTRXDV        (1U <<  9U)
#define EMAC_PC_MDIXEN          (1U << 10U)
#define EMAC_PC_FASTMDIX        (1U << 11U)
#define EMAC_PC_RBSTMDIX        (1U << 12U)
#define EMAC_PC_MDISWAP         (1U << 13U)
#define EMAC_PC_POLSWAP         (1U << 14U)
#define EMAC_PC_TDRRUN          (1U << 20U)
#define EMAC_PC_LRR             (1U << 21U)
#define EMAC_PC_ISOMIILL        (1U << 22U)
#define EMAC_PC_RXERIDLE        (1U << 23U)
#define EMAC_PC_NIBDETDIS       (1U << 24U)
#define EMAC_PC_DIGRESTART      (1U << 25U)
#define EMAC_PC_PHYEXT          (1U << 31U)

