EtchedPixels/FUZIX/Kernel/platform-dk-tm4c129x/eth.c
#define EMAC_PC_ANMODE_10HD     0U
#define EMAC_PC_ANMODE_10FD     2U
#define EMAC_PC_ANMODE_100HD    4U
#define EMAC_PC_ANMODE_100FD    6U

#define EMAC_PC_PINTFS_MII      (0U << 28U)
#define EMAC_PC_PINTFS_RMII     (4U << 28U)

#define EMAC_CC_CLKEN     (1U << 16U)
#define EMAC_CC_POL       (1U << 17U)
#define EMAC_CC_PTPCEN    (1U << 18U)

#define EMAC_RDES0_ESA    (1U <<  0U)
#define EMAC_RDES0_CE     (1U <<  1U)
#define EMAC_RDES0_DBE    (1U <<  2U)
#define EMAC_RDES0_RE     (1U <<  3U)
#define EMAC_RDES0_RWT    (1U <<  4U)
#define EMAC_RDES0_FT     (1U <<  5U)
#define EMAC_RDES0_LCO    (1U <<  6U)
#define EMAC_RDES0_TSV    (1U <<  7U)
#define EMAC_RDES0_GIANT  (1U <<  7U)
#define EMAC_RDES0_LS     (1U <<  8U)
#define EMAC_RDES0_FS     (1U <<  9U)
#define EMAC_RDES0_VLAN   (1U << 10U)
#define EMAC_RDES0_OE     (1U << 11U)
#define EMAC_RDES0_LE     (1U << 12U)
#define EMAC_RDES0_SAF    (1U << 13U)
#define EMAC_RDES0_DE     (1U << 14U)
#define EMAC_RDES0_ES     (1U << 15U)
#define EMAC_RDES0_AFM    (1U << 30U)
#define EMAC_RDES0_OWN    (1U << 31U)

#define EMAC_RDES0_FL_SHIFT     16U
#define EMAC_RDES0_FL_MASK      (0x3fffU << EMAC_RDES0_FL_SHIFT)

#define EMAC_RDES1_RCH    (1U << 14U)
#define EMAC_RDES1_RER    (1U << 15U)
#define EMAC_RDES1_DIC    (1U << 31U)

#define EMAC_TDES0_DB     (1U <<  0U)
#define EMAC_TDES0_UF     (1U <<  1U)
#define EMAC_TDES0_ED     (1U <<  2U)
#define EMAC_TDES0_VF     (1U <<  7U)
#define EMAC_TDES0_EC     (1U <<  8U)
#define EMAC_TDES0_LCO    (1U <<  9U)
#define EMAC_TDES0_NC     (1U << 10U)
#define EMAC_TDES0_LCA    (1U << 11U)
#define EMAC_TDES0_IPE    (1U << 12U)
#define EMAC_TDES0_FF     (1U << 13U)
#define EMAC_TDES0_JT     (1U << 14U)
#define EMAC_TDES0_ES     (1U << 15U)
#define EMAC_TDES0_IHE    (1U << 16U)
#define EMAC_TDES0_TTSS   (1U << 17U)
#define EMAC_TDES0_TCH    (1U << 20U)
#define EMAC_TDES0_TER    (1U << 21U)
#define EMAC_TDES0_CRCR   (1U << 24U)
#define EMAC_TDES0_TTSE   (1U << 25U)
#define EMAC_TDES0_DP     (1U << 26U)
#define EMAC_TDES0_DC     (1U << 27U)
#define EMAC_TDES0_FS     (1U << 28U)
#define EMAC_TDES0_LS     (1U << 29U)
#define EMAC_TDES0_IC     (1U << 30U)
#define EMAC_TDES0_OWN    (1U << 31U)

#define EMAC_MIIADDR_MIIB 1U
#define EMAC_MIIADDR_MIIW 2U

#define EMAC_MIIADDR_CR_MASK 60U
#if (SYS_CLOCK >= 20000000) && (SYS_CLOCK < 35000000)
#define EMAC_MIIADDR_CR 8U
#elif (SYS_CLOCK >= 35000000) && (SYS_CLOCK <= 64000000)
#define EMAC_MIIADDR_CR 12U
#elif (SYS_CLOCK >= 60000000) && (SYS_CLOCK <= 104000000)
#define EMAC_MIIADDR_CR 0U
#elif (SYS_CLOCK >= 100000000) && (SYS_CLOCK <= 150000000)
#define EMAC_MIIADDR_CR 4U
#elif (SYS_CLOCK >= 150000000) && (SYS_CLOCK <= 168000000)
#define EMAC_MIIADDR_CR 16U
#else
#error Unsupported SYS_CLOCK.
#endif

#define EMAC_MIIADDR_PLA_SHIFT  11U
#define EMAC_MIIADDR_PLA_MASK   (31U << EMAC_MIIADDR_PLA_SHIFT)
#define EMAC_MIIADDR_MII_SHIFT  6U
#define EMAC_MIIADDR_MII_MASK   (31U << EMAC_MIIADDR_MII_SHIFT)

#define EMAC_CFG_RE       (1U <<  2U)
#define EMAC_CFG_TE       (1U <<  3U)
#define EMAC_CFG_DC       (1U <<  4U)
#define EMAC_CFG_ACS      (1U <<  7U)
#define EMAC_CFG_DR       (1U <<  9U)
#define EMAC_CFG_IPC      (1U << 10U)
#define EMAC_CFG_DUPM     (1U << 11U)
#define EMAC_CFG_LOOPBM   (1U << 12U)
#define EMAC_CFG_DRO      (1U << 13U)
#define EMAC_CFG_FES      (1U << 14U)
#define EMAC_CFG_PS       (1U << 15U)
#define EMAC_CFG_DISCRS   (1U << 16U)
#define EMAC_CFG_JFEN     (1U << 20U)
#define EMAC_CFG_JD       (1U << 22U)
#define EMAC_CFG_WDDIS    (1U << 23U)
#define EMAC_CFG_CST      (1U << 25U)
#define EMAC_CFG_TWOKPEN  (1U << 27U)

#define EMAC_CFG_BL_MASK  (3U <<  5U)

#define EMAC_CFG_BL_10    (0U <<  5U)
#define EMAC_CFG_BL_8     (1U <<  5U)
#define EMAC_CFG_BL_4     (2U <<  5U)
#define EMAC_CFG_BL_1     (3U <<  5U)

#define EMAC_CFG_IFG_MASK (7U << 17U)

#define EMAC_CFG_IFG_96   (0U << 17U)
#define EMAC_CFG_IFG_88   (1U << 17U)
#define EMAC_CFG_IFG_80   (2U << 17U)
#define EMAC_CFG_IFG_72   (3U << 17U)
#define EMAC_CFG_IFG_64   (4U << 17U)
#define EMAC_CFG_IFG_56   (5U << 17U)
#define EMAC_CFG_IFG_48   (6U << 17U)
#define EMAC_CFG_IFG_40   (7U << 17U)

#define MACCR_CLEAR_BITS                                             \
  (EMAC_CFG_RE | EMAC_CFG_TE | EMAC_CFG_DC | EMAC_CFG_BL_MASK |      \
   EMAC_CFG_ACS | EMAC_CFG_DR | EMAC_CFG_IPC | EMAC_CFG_DUPM |       \
   EMAC_CFG_LOOPBM | EMAC_CFG_DRO | EMAC_CFG_FES | EMAC_CFG_DISCRS | \
   EMAC_CFG_IFG_MASK | EMAC_CFG_JD | EMAC_CFG_WDDIS | EMAC_CFG_CST)

#ifdef EMAC_HWCHECKSUM
#define MACCR_SET_BITS \
  (EMAC_CFG_BL_10 | EMAC_CFG_DR | EMAC_CFG_IPC | EMAC_CFG_IFG_96)
#else
#define MACCR_SET_BITS \
  (EMAC_CFG_BL_10 | EMAC_CFG_DR | EMAC_CFG_IFG_96)
#endif

#define EMAC_FRAMEFLTR_PR       (1U <<  0U)
#define EMAC_FRAMEFLTR_HUC      (1U <<  1U)
#define EMAC_FRAMEFLTR_HMC      (1U <<  2U)
#define EMAC_FRAMEFLTR_DAIF     (1U <<  3U)
#define EMAC_FRAMEFLTR_PM       (1U <<  4U)
#define EMAC_FRAMEFLTR_DBF      (1U <<  5U)
#define EMAC_FRAMEFLTR_SAIF     (1U <<  8U)
#define EMAC_FRAMEFLTR_SAF      (1U <<  9U)
#define EMAC_FRAMEFLTR_HPF      (1U << 10U)
#define EMAC_FRAMEFLTR_VTFE     (1U << 16U)
#define EMAC_FRAMEFLTR_RA       (1U << 31U)

#define EMAC_FRAMEFLTR_PCF_MASK     (3U << 6U)

#define EMAC_FRAMEFLTR_PCF_NONE     (0U << 6U)
#define EMAC_FRAMEFLTR_PCF_PAUSE    (1U << 6U)
#define EMAC_FRAMEFLTR_PCF_ALL      (2U << 6U)
#define EMAC_FRAMEFLTR_PCF_FILTER   (3U << 6U)

#define FRAMEFLTR_CLEAR_BITS                                            \
  (EMAC_FRAMEFLTR_PR | EMAC_FRAMEFLTR_HUC | EMAC_FRAMEFLTR_HMC |        \
   EMAC_FRAMEFLTR_DAIF | EMAC_FRAMEFLTR_PM | EMAC_FRAMEFLTR_DBF |       \
   EMAC_FRAMEFLTR_PCF_MASK | EMAC_FRAMEFLTR_SAIF | EMAC_FRAMEFLTR_SAF | \
   EMAC_FRAMEFLTR_HPF | EMAC_FRAMEFLTR_RA)

#define FRAMEFLTR_SET_BITS EMAC_FRAMEFLTR_PCF_PAUSE

#define EMAC_FLOWCTL_FCBBPA     (1U << 0U)
#define EMAC_FLOWCTL_TFE        (1U << 1U)
#define EMAC_FLOWCTL_RFE        (1U << 2U)
#define EMAC_FLOWCTL_UP         (1U << 3U)
#define EMAC_FLOWCTL_DZQP       (1U << 7U)

#define EMAC_FLOWCTL_PLT_MASK   (3U << 4U)

#define EMAC_FLOWCTL_PLT_M4     (0U << 4U)
#define EMAC_FLOWCTL_PLT_M28    (1U << 4U)
#define EMAC_FLOWCTL_PLT_M144   (2U << 4U)
#define EMAC_FLOWCTL_PLT_M256   (3U << 4U)

#define EMAC_FLOWCTL_PT_MASK    (0xffffU << 16U)

