EtchedPixels/FUZIX/Kernel/platform-dk-tm4c129x/eth.c
#define FLOWCTL_CLEAR_MASK                                       \
  (EMAC_FLOWCTL_FCBBPA | EMAC_FLOWCTL_TFE | EMAC_FLOWCTL_RFE |   \
   EMAC_FLOWCTL_UP | EMAC_FLOWCTL_PLT_MASK | EMAC_FLOWCTL_DZQP | \
   EMAC_FLOWCTL_PT_MASK)

#define FLOWCTL_SET_MASK (EMAC_FLOWCTL_PLT_M4 | EMAC_FLOWCTL_DZQP)

#define EMAC_DMAOPMODE_SR       (1U <<  1U)
#define EMAC_DMAOPMODE_OSF      (1U <<  2U)
#define EMAC_DMAOPMODE_DGF      (1U <<  5U)
#define EMAC_DMAOPMODE_FUF      (1U <<  6U)
#define EMAC_DMAOPMODE_FEF      (1U <<  7U)
#define EMAC_DMAOPMODE_ST       (1U << 13U)
#define EMAC_DMAOPMODE_FTF      (1U << 20U)
#define EMAC_DMAOPMODE_TSF      (1U << 21U)
#define EMAC_DMAOPMODE_DFF      (1U << 24U)
#define EMAC_DMAOPMODE_RSF      (1U << 25U)
#define EMAC_DMAOPMODE_DT       (1U << 26U)

#define EMAC_DMAOPMODE_RTC_MASK (3U << 3U)

#define EMAC_DMAOPMODE_RTC_64   (0U << 3U)
#define EMAC_DMAOPMODE_RTC_32   (1U << 3U)
#define EMAC_DMAOPMODE_RTC_96   (2U << 3U)
#define EMAC_DMAOPMODE_RTC_128  (3U << 3U)

#define EMAC_DMAOPMODE_TTC_MASK (7U << 14U)

#define EMAC_DMAOPMODE_TTC_64   (0U << 14U)
#define EMAC_DMAOPMODE_TTC_128  (1U << 14U)
#define EMAC_DMAOPMODE_TTC_192  (2U << 14U)
#define EMAC_DMAOPMODE_TTC_256  (3U << 14U)
#define EMAC_DMAOPMODE_TTC_40   (4U << 14U)
#define EMAC_DMAOPMODE_TTC_32   (5U << 14U)
#define EMAC_DMAOPMODE_TTC_24   (6U << 14U)
#define EMAC_DMAOPMODE_TTC_16   (7U << 14U)

#define DMAOPMODE_CLEAR_MASK \
  (EMAC_DMAOPMODE_SR | EMAC_DMAOPMODE_OSF | EMAC_DMAOPMODE_RTC_MASK | \
   EMAC_DMAOPMODE_DGF | EMAC_DMAOPMODE_FUF | EMAC_DMAOPMODE_FEF |     \
   EMAC_DMAOPMODE_ST | EMAC_DMAOPMODE_TTC_MASK | EMAC_DMAOPMODE_FTF | \
   EMAC_DMAOPMODE_TSF | EMAC_DMAOPMODE_DFF | EMAC_DMAOPMODE_RSF |     \
   EMAC_DMAOPMODE_DT)

#ifdef EMAC_HWCHECKSUM
#define DMAOPMODE_SET_MASK                                              \
  (EMAC_DMAOPMODE_OSF | EMAC_DMAOPMODE_RTC_64 | EMAC_DMAOPMODE_TTC_64 | \
   EMAC_DMAOPMODE_TSF | EMAC_DMAOPMODE_RSF)
#else
#define DMAOPMODE_SET_MASK                                              \
  (EMAC_DMAOPMODE_OSF | EMAC_DMAOPMODE_RTC_64 | EMAC_DMAOPMODE_TTC_64 | \
   EMAC_DMAOPMODE_DT)
#endif

#define DMABUSMOD_CLEAR_MASK                                                \
  (EMAC_DMABUSMOD_SWR | EMAC_DMABUSMOD_DA | EMAC_DMABUSMOD_DSL_MASK |       \
   EMAC_DMABUSMOD_ATDS | EMAC_DMABUSMOD_PBL_MASK | EMAC_DMABUSMOD_PR_MASK | \
   EMAC_DMABUSMOD_FB | EMAC_DMABUSMOD_RPBL_MASK | EMAC_DMABUSMOD_USP |      \
   EMAC_DMABUSMOD_8XPBL | EMAC_DMABUSMOD_AAL | EMAC_DMABUSMOD_MB |          \
   EMAC_DMABUSMOD_TXPR | EMAC_DMABUSMOD_RIB)

#define DMABUSMOD_SET_MASK                                               \
  (EMAC_DMABUSMOD_DA | EMAC_DMABUSMOD_DSL(0) | __EMAC_DMABUSMOD_ATDS |   \
   __EMAC_DMABUSMOD_PBL | __EMAC_DMABUSMOD_RPBL | __EMAC_DMABUSMOD_USP | \
   __EMAC_DMABUSMOD_8XPBL | EMAC_DMABUSMOD_MB)

#define EPHY_STS_LINK     (1U <<  0U)
#define EPHY_STS_SPEED    (1U <<  1U)
#define EPHY_STS_DUPLEX   (1U <<  2U)
#define EPHY_STS_MIILB    (1U <<  3U)
#define EPHY_STS_ANS      (1U <<  4U)
#define EPHY_STS_JD       (1U <<  5U)
#define EPHY_STS_RF       (1U <<  6U)
#define EPHY_STS_MIIREQ   (1U <<  7U)
#define EPHY_STS_PAGERX   (1U <<  8U)
#define EPHY_STS_DL       (1U <<  9U)
#define EPHY_STS_SD       (1U << 10U)
#define EPHY_STS_FCSL     (1U << 11U)
#define EPHY_STS_POLSTAT  (1U << 12U)
#define EPHY_STS_RXLERR   (1U << 13U)
#define EPHY_STS_MDIXM    (1U << 14U)

#define MII_MCR           0x00U
#define MII_MSR           0x01U
#define MII_PHYID1        0x02U
#define MII_PHYID2        0x03U
#define MII_ADVERTISE     0x04U
#define MII_LPA           0x05U
#define MII_EXPANSION     0x06U
#define MII_NEXTPAGE      0x07U
#define MII_LPANEXTPAGE   0x08U
#define MII_MSCONTROL     0x09U
#define MII_MSSTATUS      0x0aU
#define MII_PSECONTROL    0x0bU
#define MII_PSESTATUS     0x0cU
#define MII_MMDCONTROL    0x0dU
#define MII_ESTATUS       0x0fU

#define MII_MCR_UNIDIR    (1U <<  5U)
#define MII_MCR_SPEED1000 (1U <<  6U)
#define MII_MCR_CTST      (1U <<  7U)
#define MII_MCR_FULLDPLX  (1U <<  8U)
#define MII_MCR_ANRESTART (1U <<  9U)
#define MII_MCR_ISOLATE   (1U << 10U)
#define MII_MCR_PDOWN     (1U << 11U)
#define MII_MCR_ANENABLE  (1U << 12U)
#define MII_MCR_SPEED100  (1U << 13U)
#define MII_MCR_LOOPBACK  (1U << 14U)
#define MII_MCR_RESET     (1U << 15U)

#define MII_MSR_EXTCAP          (1U <<  0U)
#define MII_MSR_JABBERDETECT    (1U <<  1U)
#define MII_MSR_LINKSTATUS      (1U <<  2U)
#define MII_MSR_ANEGABLE        (1U <<  3U)
#define MII_MSR_RFAULT          (1U <<  4U)
#define MII_MSR_ANEGCOMPLETE    (1U <<  5U)
#define MII_MSR_MFRAMESUPPRESS  (1U <<  6U)
#define MII_MSR_UNIDIR          (1U <<  7U)
#define MII_MSR_ESTATEN         (1U <<  8U)
#define MII_MSR_100BASET2FULL   (1U <<  9U)
#define MII_MSR_100BASET2HALF   (1U << 10U)
#define MII_MSR_10BASETXHALF    (1U << 11U)
#define MII_MSR_10BASETXFULL    (1U << 12U)
#define MII_MSR_100BASETXHALF   (1U << 13U)
#define MII_MSR_100BASETXFULL   (1U << 14U)
#define MII_MSR_100BASET4       (1U << 15U)

struct emac_txdesc_s
{
  uint32_t tdes0;
  uint32_t tdes1;
  uint32_t tdes2;
  uint32_t tdes3;
};

struct emac_rxdesc_s
{
  uint32_t rdes0;
  uint32_t rdes1;
  uint32_t rdes2;
  uint32_t rdes3;
};

static uint8_t rxbuffer[EMAC_NRXDESC * OPTIMAL_EMAC_BUFSIZE];
static struct emac_rxdesc_s rxtable[EMAC_NRXDESC];
static struct emac_txdesc_s txtable[EMAC_NTXDESC];
static struct emac_rxdesc_s *rxhead = NULL;
static struct emac_rxdesc_s *rxcurr = NULL;
static struct emac_txdesc_s *txhead = NULL;
static struct emac_txdesc_s *txtail = NULL;
static unsigned char queue_base[EMAC_NFREEBUFFERS];

static struct s_queue q = {
  .q_base = queue_base,
  .q_head = queue_base,
  .q_tail = queue_base,
  .q_size = EMAC_NFREEBUFFERS,
  .q_count = 0,
  .q_wakeup = EMAC_NFREEBUFFERS
};

static struct buff_s {
  uint8_t buff[OPTIMAL_EMAC_BUFSIZE];
  uint_fast8_t used;
} buffers[EMAC_NFREEBUFFERS];

static size_t rxsegments = 0U;
static size_t txinflight = 0U;
static uint8_t *d_buf = NULL;
static size_t d_len = 0U;

struct eth_hdr_s
{
  uint8_t dest[6U];
  uint8_t src[6U];
  uint16_t type;
};
