EtchedPixels/FUZIX/Kernel/platform-dk-tm4c129x/eth.c
#define ETH_HDR(ptr) ((struct eth_hdr_s *)(ptr))

#define ETHTYPE_ARP  0x0806U
#define ETHTYPE_IP   0x0800U
#define ETHTYPE_IP6  0x86ddU

static uint8_t mac_addr[6U] = { 0U, 0U, 0U, 0U, 0U, 0U };

#if 0 // TODO: make a glue code from it
static uint16_t autoport = htons(5000);
static uint32_t ipa = 0U;
static uint32_t iga = 0U;
static uint32_t igm = 0U;
static uint16_t ifflags = IFF_BROADCAST | IFF_RUNNING | IFF_UP;

arg_t eth_ioctl(struct socket *s, int op, char *ifr_u /* in user space */)
{
  static struct ifreq ifr;

  if (uget(ifr_u, &ifr, sizeof(struct ifreq)))
    return -1;
  if (op != SIOCGIFNAME && memcmp(ifr.ifr_name, "eth0", 5U)) {
    udata.u_error = ENODEV;
    return -1;
  }
  switch (op) {
  /* Get side */
  case SIOCGIFNAME:
    if (ifr.ifr_ifindex) {
      udata.u_error = ENODEV;
      return -1;
    }
    memcpy(ifr.ifr_name, "eth0", 5U);
    goto copyback;
  case SIOCGIFINDEX:
    ifr.ifr_ifindex = 0;
    goto copyback;
  case SIOCGIFFLAGS:
    ifr.ifr_flags = ifflags;
    goto copyback;
  case SIOCGIFADDR:
    ifr.ifr_addr.sa.sin.sin_addr.s_addr = ipa;
    goto copy_addr;
  case SIOCGIFBRDADDR:
    /* Hardcoded in the engine */
    ifr.ifr_broadaddr.sa.sin.sin_addr.s_addr = (ipa & igm) | ~igm;
    goto copy_addr;
  case SIOCGIFGWADDR:
    ifr.ifr_gwaddr.sa.sin.sin_addr.s_addr = iga;
    goto copy_addr;
  case SIOCGIFNETMASK:
    ifr.ifr_netmask.sa.sin.sin_addr.s_addr = igm;
    goto copy_addr;
  case SIOCGIFHWADDR:
    memcpy(ifr.ifr_hwaddr.sa.hw.shw_addr, mac_addr, 6U);
    ifr.ifr_hwaddr.sa.hw.shw_family = HW_ETH;
    goto copyback;
  case SIOCGIFMTU:
    ifr.ifr_mtu = 1500;
    goto copyback;
    /* Set side */
  case SIOCSIFFLAGS:
    /* Doesn't really do anything ! */
    ifflags &= ~IFF_UP;
    ifflags |= ifr.ifr_flags & IFF_UP;
    return 0;
  case SIOCSIFADDR:
    ipa = ifr.ifr_addr.sa.sin.sin_addr.s_addr;
    break;
  case SIOCSIFGWADDR:
    iga = ifr.ifr_gwaddr.sa.sin.sin_addr.s_addr;
    break;
  case SIOCSIFNETMASK:
    igm = ifr.ifr_netmask.sa.sin.sin_addr.s_addr;
    break;
  case SIOCSIFHWADDR:
    memcpy(mac_addr, ifr.ifr_hwaddr.sa.hw.shw_addr, 6U);
    /* Not setting hwaddr really! */
    break;
  default:
    udata.u_error = EINVAL;
    return -1;
  }
  return 0;
copy_addr:
  ifr.ifr_addr.sa.sin.sin_family = AF_INET;
copyback:
  return uput(&ifr, ifr_u, sizeof ifr);
}
#endif

static int eth_phyread(uint16_t phydevaddr,
                       uint16_t phyregaddr, uint16_t *value)
{
  volatile uint32_t timeout;
  uint32_t regval;

  regval = inl(EMAC_MIIADDR);
  regval &= EMAC_MIIADDR_CR_MASK;
  regval |= (phydevaddr << EMAC_MIIADDR_PLA_SHIFT) & EMAC_MIIADDR_PLA_MASK;
  regval |= (phyregaddr << EMAC_MIIADDR_MII_SHIFT) & EMAC_MIIADDR_MII_MASK;
  regval |= EMAC_MIIADDR_MIIB;
  outl(EMAC_MIIADDR, regval);
  for (timeout = 0U; timeout < PHY_READ_TIMEOUT; timeout++) {
    if (!((inl(EMAC_MIIADDR)) & EMAC_MIIADDR_MIIB)) {
      *value = ((uint16_t)(inl(EMAC_MIIDATA)));
      return 0;
    }
  }
  return -ETIMEDOUT;
}

static int eth_phywrite(uint16_t phydevaddr,
                        uint16_t phyregaddr, uint16_t value)
{
  volatile uint32_t timeout;
  uint32_t regval;

  regval = inl(EMAC_MIIADDR);
  regval &= EMAC_MIIADDR_CR_MASK;
  regval |= (phydevaddr << EMAC_MIIADDR_PLA_SHIFT) & EMAC_MIIADDR_PLA_MASK;
  regval |= (phyregaddr << EMAC_MIIADDR_MII_SHIFT) & EMAC_MIIADDR_MII_MASK;
  regval |= (EMAC_MIIADDR_MIIB | EMAC_MIIADDR_MIIW);
  outl(EMAC_MIIDATA, value);
  outl(EMAC_MIIADDR, regval);
  for (timeout = 0U; timeout < PHY_WRITE_TIMEOUT; timeout++) {
    if (!((inl(EMAC_MIIADDR)) & EMAC_MIIADDR_MIIB))
      return 0;
  }
  return -ETIMEDOUT;
}

static void eth_initbuffer(void)
{
  uint_fast8_t u;

  for (u = 0U; u < EMAC_NFREEBUFFERS; u++) {
    buffers[u].used = 0U;
    insq(&q, u);
  }
}

static uint8_t *eth_allocbuffer(void)
{
  uint_fast8_t uc = 0U;

  if (!(remq(&q, &uc)))
    return NULL;
  if (buffers[uc].used)
    return NULL;
  buffers[uc].used = (uc & 0x80U);
  return buffers[uc].buff;
}

static void eth_freebuffer(uint8_t *buffer)
{
  const struct buff_s *buf = ((struct buff_s *)
                               (buffer - offsetof(struct buff_s, buff)));
  uint_fast8_t uc = buf->used;

  buffers[uc].used = 0U;
  insq(&q, uc);
}

static void eth_freesegment(struct emac_rxdesc_s *rxfirst, size_t segments)
{
  struct emac_rxdesc_s *rxdesc;
  unsigned u;

  rxdesc = rxfirst;
  for (u = 0U; u < segments; u++) {
    rxdesc->rdes0 = EMAC_RDES0_OWN;
    rxdesc = ((struct emac_rxdesc_s *)(rxdesc->rdes3));
  }
  rxcurr = NULL;
  rxsegments = 0U;
  if (inl(EMAC_DMARIS) & EMAC_DMAINT_RBUI) {
    outl(EMAC_DMARIS, EMAC_DMAINT_RBUI);
    outl(EMAC_RXPOLLD, 0U);
  }
}

static void eth_enableint(uint32_t ierbit)
{
  uint32_t regval;

  regval = inl(EMAC_DMAIM);
  regval |= (EMAC_DMAINT_NIS | ierbit);
  outl(EMAC_DMAIM, regval);
}

static void eth_disableint(uint32_t ierbit)
{
  uint32_t regval;

  regval = inl(EMAC_DMAIM);
  regval &= (~ierbit);
  if (!(regval & EMAC_DMAINT_NORMAL))
    regval &= (~EMAC_DMAINT_NIS);
  outl(EMAC_DMAIM, regval);
}

static void eth_transmit(void)
{
  struct emac_txdesc_s *txdesc = txhead;
  struct emac_txdesc_s *txfirst = txdesc;

  txdesc->tdes0 |= (EMAC_TDES0_FS | EMAC_TDES0_LS | EMAC_TDES0_IC);
  txdesc->tdes1 = d_len;
  txdesc->tdes2 = ((uint32_t)(d_buf));
  txdesc->tdes0 |= EMAC_TDES0_OWN;
  txdesc = ((struct emac_txdesc_s *)(txdesc->tdes3));
  txhead = txdesc;
  d_buf = NULL;
  d_len = 0U;
  if (!txtail)
    txtail = txfirst;
  txinflight++;
  if (txinflight >= EMAC_NTXDESC)
    eth_disableint(EMAC_DMAINT_RI);
  if ((inl(EMAC_DMARIS)) & EMAC_DMAINT_TBUI) {
    outl(EMAC_DMARIS, EMAC_DMAINT_TBUI);
    outl(EMAC_TXPOLLD, 0U);
  }
  eth_enableint(EMAC_DMAINT_TI);
}

static bool eth_recvframe(void)
{
  struct emac_rxdesc_s *rxdesc;
  struct emac_rxdesc_s *rxcur;
  uint8_t *buffer;
  unsigned u;

  if (!(q.q_count)) // TODO: should this queue be updated in this function?!
    return false;
  rxdesc = rxhead;
  for (u = 0U;
       ((!(rxdesc->rdes0 & EMAC_RDES0_OWN)) &&
        (u < EMAC_NRXDESC) &&
        (txinflight < EMAC_NTXDESC));
       u++) {
    if ((rxdesc->rdes0 & EMAC_RDES0_FS) && (!(rxdesc->rdes0 & EMAC_RDES0_LS))) {
      rxcurr = rxdesc;
      rxsegments = 1U;
    } else if ((!(rxdesc->rdes0 & EMAC_RDES0_LS)) &&
               (!(rxdesc->rdes0 & EMAC_RDES0_FS))) {
      rxsegments++;
    } else {
      rxsegments++;
      rxcur = (1U == rxsegments) ? rxdesc : rxcurr;
      if (!(rxdesc->rdes0 & EMAC_RDES0_ES)) {
        d_len = ((rxdesc->rdes0 & EMAC_RDES0_FL_MASK) >> EMAC_RDES0_FL_SHIFT);
        d_len -= 4U;
        buffer = eth_allocbuffer();
        if (!buffer)
          return false;
        if (d_buf)
          return false;
        d_buf = ((uint8_t *)(rxcur->rdes2));
        rxcur->rdes2 = ((uint32_t)(buffer));
        rxhead = ((struct emac_rxdesc_s *)(rxdesc->rdes3));
        eth_freesegment(rxcur, rxsegments);
        return true;
      } else {
        eth_freesegment(rxcur, rxsegments);
      }
    }
    rxdesc = ((struct emac_rxdesc_s *)(rxdesc->rdes3));
  }
  rxhead = rxdesc;
  return false;
}

static void eth_receive_frame(void)
{
  while (eth_recvframe()) {
    if ((!(d_len > ETH_PKTSIZE)) && d_buf) {
      if (htons(ETHTYPE_IP) == (ETH_HDR(d_buf)->type)) {
        // TODO: Handle ARP on input then give the IPv4 packet to the net layer
        if (d_len > 0U) {
          // TODO: Update the eth header with the correct MAC address, ARP out
          eth_transmit();
        }
      } else if (htons(ETHTYPE_ARP) == (ETH_HDR(d_buf)->type)) {
        // TODO: ARP in
        if (d_len > 0)
          eth_transmit();
      }
      if (d_buf) {
        eth_freebuffer(d_buf);
        d_buf = NULL;
        d_len = 0U;
      }
    }
  }
}

