EtchedPixels/FUZIX/Kernel/platform-dk-tm4c129x/eth.c
static __attribute__((noinline)) void eth_mdelay(unsigned ms)
{
  volatile unsigned i, j;

  for (i = 0U; i < ms; i++) {
    for (j = 0U; j < BOARD_LOOPSPERMSEC; j++)
      asm volatile("");
  }
}

static irqreturn_t eth_isr(unsigned int irq, void *dev_id, uint32_t *regs)
{
  uint32_t regval;

  regval = inl(EMAC_DMARIS);
  if (regval) {
    disable_irq(IRQ_ETHCON);
    regval = inl(EMAC_DMARIS);
    regval &= inl(EMAC_DMAIM);
    if (regval & EMAC_DMAINT_NIS) {
      if (regval & EMAC_DMAINT_RI) {
        outl(EMAC_DMARIS, EMAC_DMAINT_RI);
        eth_receive_frame();
      }
      if (regval & EMAC_DMAINT_TI) {
        outl(EMAC_DMARIS, EMAC_DMAINT_TI);
        // TODO: finish with transmit (txdone)
      }
      outl(EMAC_DMARIS, EMAC_DMAINT_NIS);
    }
    enable_irq(IRQ_ETHCON);
  }
  return IRQ_HANDLED;
}

static __attribute__((noinline)) void eth_reset(void)
{
  uint32_t regval;

  regval  = inl(EMAC_DMABUSMOD);
  regval |= EMAC_DMABUSMOD_SWR;
  outl(EMAC_DMABUSMOD, regval);
  while ((inl(EMAC_DMABUSMOD)) & EMAC_DMABUSMOD_SWR) { }
  eth_mdelay(1U);
  regval = EMAC_PC_MDIXEN | EMAC_PC_ANMODE_100FD | EMAC_PC_ANEN |
           EMAC_PC_PINTFS_MII;
  outl(EMAC_PC, regval);
  regval = inl(SYSCON_SREPHY);
  regval |= SREPHY_R0;
  outl(SYSCON_SREPHY, regval);
  regval &= ~SREPHY_R0;
  outl(SYSCON_SREPHY, regval);
  while (!ephy_periphrdy()) { }
  eth_mdelay(1U);
  outl(EMAC_MMCRXIM, 0xffffffffU);
  outl(EMAC_MMCTXIM, 0xffffffffU);
  regval = inl(EMAC_CC);
  regval &= ~EMAC_CC_CLKEN;
  outl(EMAC_CC, regval);
}

static __attribute__((noinline)) void eth_ifup(void)
{
  uint16_t phyval;
  uint32_t regval;
  unsigned u;
  volatile uint32_t timeout;

  eth_reset();
  regval = inl(EMAC_MIIADDR);
  regval &= ~EMAC_MIIADDR_CR_MASK;
  regval |= EMAC_MIIADDR_CR;
  outl(EMAC_MIIADDR, regval);
  if ((eth_phywrite(INTERNAL_PHY_PHYADDR, MII_MCR, MII_MCR_RESET)) < 0) {
    for (;;)
      asm("wfe");
  }
  eth_mdelay(PHY_RESET_DELAY);
  for (timeout = 0U; timeout < PHY_RETRY_TIMEOUT; timeout++) {
    phyval = 0U;
    if ((eth_phyread(INTERNAL_PHY_PHYADDR, MII_MSR, &phyval)) < 0) {
      for (;;)
        asm("wfe");
    }
    if (phyval & MII_MSR_LINKSTATUS)
      break;
  }
  if (timeout >= PHY_RETRY_TIMEOUT) {
    for (;;)
      asm("wfe");
  }
  if ((eth_phywrite(INTERNAL_PHY_PHYADDR, MII_MCR, MII_MCR_ANENABLE)) < 0) {
    for (;;)
      asm("wfe");
  }
  for (timeout = 0U; timeout < PHY_RETRY_TIMEOUT; timeout++) {
    if ((eth_phyread(INTERNAL_PHY_PHYADDR, MII_MSR, &phyval)) < 0) {
      for (;;)
        asm("wfe");
    }
    if (phyval & MII_MSR_ANEGCOMPLETE)
      break;
  }
  if (timeout >= PHY_RETRY_TIMEOUT) {
    for (;;)
      asm("wfe");
  }
  if ((eth_phyread(INTERNAL_PHY_PHYADDR, EPHY_STS, &phyval)) < 0) {
    for (;;)
      asm("wfe");
  }
  regval = inl(EMAC_CFG);
  regval &= ~MACCR_CLEAR_BITS;
  regval |= MACCR_SET_BITS;
  if (EPHY_STS_DUPLEX == (phyval & EPHY_STS_DUPLEX))
    regval |= EMAC_CFG_DUPM;
  if (!(phyval & EPHY_STS_SPEED))
    regval |= EMAC_CFG_FES;
  outl(EMAC_CFG, regval);
  regval = inl(EMAC_FRAMEFLTR);
  regval &= ~FRAMEFLTR_CLEAR_BITS;
  regval |= FRAMEFLTR_SET_BITS;
  outl(EMAC_FRAMEFLTR, regval);
  outl(EMAC_HASHTBLH, 0U);
  outl(EMAC_HASHTBLL, 0U);
  regval = inl(EMAC_FLOWCTL);
  regval &= ~FLOWCTL_CLEAR_MASK;
  regval |= FLOWCTL_SET_MASK;
  outl(EMAC_FLOWCTL, regval);
  outl(EMAC_VLANTG, 0U);
  regval = inl(EMAC_DMAOPMODE);
  regval &= ~DMAOPMODE_CLEAR_MASK;
  regval |= DMAOPMODE_SET_MASK;
  outl(EMAC_DMAOPMODE, regval);
  regval = inl(EMAC_DMABUSMOD);
  regval &= ~DMABUSMOD_CLEAR_MASK;
  regval |= DMABUSMOD_SET_MASK;
  outl(EMAC_DMABUSMOD, regval);
  eth_initbuffer();
  txhead = txtable;
  txtail = NULL;
  txinflight = 0U;
  for (u = 0U; u < EMAC_NTXDESC; u++) {
    txtable[u].tdes0 = EMAC_TDES0_TCH;
    txtable[u].tdes2 = 0U;
    txtable[u].tdes3 = ((u < (EMAC_NTXDESC - 1U)) ?
                         ((uint32_t)(&txtable[u + 1U])) :
                         ((uint32_t)(txtable)));
  }
  outl(EMAC_TXDLADDR, ((uint32_t)(txtable)));
  rxhead = rxtable;
  rxcurr = NULL;
  rxsegments = 0U;
  for (u = 0U; u < EMAC_NRXDESC; u++) {
    rxtable[u].rdes0 = EMAC_RDES0_OWN;
    rxtable[u].rdes1 = (EMAC_RDES1_RCH | ((uint32_t)(OPTIMAL_EMAC_BUFSIZE)));
    rxtable[u].rdes2 = ((uint32_t)(&rxbuffer[u * OPTIMAL_EMAC_BUFSIZE]));
    rxtable[u].rdes3 = ((u < (EMAC_NRXDESC - 1U)) ?
                         ((uint32_t)(&rxtable[u + 1U])) :
                         ((uint32_t)(rxtable)));
  }
  outl(EMAC_RXDLADDR, ((uint32_t)(rxtable)));
  regval = ((((uint32_t)(mac_addr[5])) <<  8U) |
             ((uint32_t)(mac_addr[4])));
  outl(EMAC_ADDR0H, regval);
  regval = ((((uint32_t)(mac_addr[3])) << 24U) |
            (((uint32_t)(mac_addr[2])) << 16U) |
            (((uint32_t)(mac_addr[1])) <<  8U) |
             ((uint32_t)(mac_addr[0])));
  outl(EMAC_ADDR0L, regval);
  regval = inl(EMAC_CFG);
  regval |= EMAC_CFG_TE;
  outl(EMAC_CFG, regval);
  regval = inl(EMAC_DMAOPMODE);
  regval |= EMAC_DMAOPMODE_FTF;
  outl(EMAC_DMAOPMODE, regval);
  regval = inl(EMAC_CFG);
  regval |= EMAC_CFG_RE;
  outl(EMAC_CFG, regval);
  regval = inl(EMAC_DMAOPMODE);
  regval |= EMAC_DMAOPMODE_ST;
  outl(EMAC_DMAOPMODE, regval);
  regval = inl(EMAC_DMAOPMODE);
  regval |= EMAC_DMAOPMODE_SR;
  outl(EMAC_DMAOPMODE, regval);
  outl(EMAC_IM, EMAC_IM_ALLINTS);
  outl(EMAC_DMAIM, EMAC_DMAINT_RECV_ENABLE | EMAC_DMAINT_ERROR_ENABLE);
}

static void eth_init(void)
{
  tm4c129x_modreg(SYSCON_PCEMAC, 0U, PCEMAC_P0);
  tm4c129x_modreg(SYSCON_RCGCEMAC, 0U, RCGCEMAC_R0);
  while (!emac_periphrdy()) { }
  eth_mdelay(1U);
  tm4c129x_modreg(SYSCON_RCGCEPHY, 0U, RCGCEPHY_R0);
  while (!ephy_periphrdy()) { }
  eth_mdelay(1U);
  tm4c129x_modreg(SYSCON_PCEPHY, 0U, PCEPHY_P0);
  while (!ephy_periphrdy()) { }
  eth_mdelay(1U);
  gpio_setup_pin(GPIO_PORT('K'), GPIO_PINFUN_PFIO, 4U,
                 GPIO_PAD_STD, 0U, 5U, 0U);
  gpio_setup_pin(GPIO_PORT('K'), GPIO_PINFUN_PFIO, 6U,
                 GPIO_PAD_STD, 0U, 5U, 0U);
  gpio_setup_pin(GPIO_PORT('F'), GPIO_PINFUN_PFIO, 1U,
                 GPIO_PAD_STD, 0U, 5U, 0U);
}

int eth_open(uint_fast8_t minor, uint16_t flag)
{
  // TODO: implement
  return -1;
}

int eth_close(uint_fast8_t minor)
{
  // TODO: implement
  return -1;
}

int eth_read(uint_fast8_t minor, uint_fast8_t rawflag, uint_fast8_t flag)
{
  // TODO: implement
  return -1;
}

int eth_write(uint_fast8_t minor, uint_fast8_t rawflag, uint_fast8_t flag)
{
  // TODO: implement
  return -1;
}

int eth_ioctl(uint_fast8_t minor, uarg_t request, char *data)
{
  // TODO: implement (see disabled code above)
  return -1;
}

void ethdev_init(void)
{
  uint32_t user0;
  uint32_t user1;
  irqflags_t fl = __hard_di();

  user0 = inl(FLASH_USERREG0);
  user1 = inl(FLASH_USERREG1);
  mac_addr[0] = ((user0 >>  0U) & 0xffU);
  mac_addr[1] = ((user0 >>  8U) & 0xffU);
  mac_addr[2] = ((user0 >> 16U) & 0xffU);
  mac_addr[3] = ((user1 >>  0U) & 0xffU);
  mac_addr[4] = ((user1 >>  8U) & 0xffU);
  mac_addr[5] = ((user1 >> 16U) & 0xffU);
  eth_init();
  while ((inl(EMAC_DMABUSMOD)) & EMAC_DMABUSMOD_SWR) { }
  eth_mdelay(1U);
  eth_ifup();
  request_irq(IRQ_ETHCON, eth_isr, NULL);
  __hard_irqrestore(fl);
}
